/**
 * Пакет является решением на второй пункт четвертого задания.
 * 2. Формируется новогодний подарок.
 * Он может включать в себя разные сладости (Candy, Jellybean, etc.)
 * У каждой сладости есть название, вес, цена и свой уникальный параметр.
 * Необходимо собрать подарок из сладостей.
 * Найти общий вес подарка, общую стоимость подарка и вывести на консоль информацию о всех сладостях в подарке.
 * @see <a href="https://moodle.appline.ru/course/view.php?id=41&section=4"> Задание в moodle</a>
 * @author Логинов М. Ю.
 */
package SweetGifts;